# EDA and data cleaning

This file is used for extract, perform exploratory data analisys, cleaning and loading data into sql database


#### Load nesessary libraries

In [22]:
import sqlite3
from sqlite3 import Error

import pandas as pd

from glob import glob
import ntpath
import sys

#### List zipped files

In [23]:
csvFiles = glob("zippedData/*.csv.gz")
csvFiles

['zippedData/bom.movie_gross.csv.gz',
 'zippedData/tmdb.movies.csv.gz',
 'zippedData/tn.movie_budgets.csv.gz',
 'zippedData/imdb.title.basics.csv.gz',
 'zippedData/imdb.name.basics.csv.gz',
 'zippedData/imdb.title.principals.csv.gz',
 'zippedData/imdb.title.crew.csv.gz',
 'zippedData/imdb.title.ratings.csv.gz',
 'zippedData/imdb.title.akas.csv.gz']

#### Functions to load files to df

In [2]:
def getFilename(path):
    """
    Function getFilename return given file name without extention 'tar.gz'
    and replaced '.' with '_'
    
    input: str path
    output: str
    
    Example:
    
        >>> getFilename('zippedData/imdb.title.akas.csv.gz')
            
            imdb_title_akas
    """
    
    head, tail = ntpath.split(path)
    
    if tail:
        return tail[:-len(".csv.gz")].replace('.', '_')
    else:
        sys.exit(f"{path} is not a file")


def loadToDF(filePath,collection):
    """
    Function loadToDF creates DataFrame from 'filepath'
    and add it to dictionary 'collection'
    
    input: str filepath, dict collection
    output: dict
    """
    
    collection[ getFilename(filePath) ] = pd.read_csv(filePath)
    
    return collection

#### Load files to df

In [25]:
dfDict = {}
for path in csvFiles:
    dfDict = loadToDF(path,dfDict)

dfDict.keys()

dict_keys(['bom_movie_gross', 'tmdb_movies', 'tn_movie_budgets', 'imdb_title_basics', 'imdb_name_basics', 'imdb_title_principals', 'imdb_title_crew', 'imdb_title_ratings', 'imdb_title_akas'])

#### List all df heads

In [26]:
for df in dfDict:
    print('___________________________________________________________________')
    display( df, dfDict[df].head(2) )
    display( dfDict[df].info() )
    display('isna', dfDict[df].isna().any() )

___________________________________________________________________

'bom_movie_gross'

                        title studio  domestic_gross foreign_gross  year
0                 Toy Story 3     BV     415000000.0     652000000  2010
1  Alice in Wonderland (2010)     BV     334200000.0     691300000  2010

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

None

'isna'

title             False
studio             True
domestic_gross     True
foreign_gross      True
year              False
dtype: bool

___________________________________________________________________

'tmdb_movies'

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   genre_ids          26517 non-null  object
 2   id                 26517 non-null  int64
 3   original_language  26517 non-null  object
 4   original_title     26517 non-null  object
 5   popularity         26517 non-null  float64
 6   release_date       26517 non-null  object
 7   title              26517 non-null  object
 8   vote_average       26517 non-null  float64
 9   vote_count         26517 non-null  int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

None

'isna'

Unnamed: 0           False
genre_ids            False
id                   False
original_language    False
original_title       False
popularity           False
release_date         False
title                False
vote_average         False
vote_count           False
dtype: bool

___________________________________________________________________

'tn_movie_budgets'

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

None

'isna'

id                   False
release_date         False
movie                False
production_budget    False
domestic_gross       False
worldwide_gross      False
dtype: bool

___________________________________________________________________

'imdb_title_basics'

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

None

'isna'

tconst             False
primary_title      False
original_title      True
start_year         False
runtime_minutes     True
genres              True
dtype: bool

___________________________________________________________________

'imdb_name_basics'

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 6 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   nconst              606648 non-null  object
 1   primary_name        606648 non-null  object
 2   birth_year          82736 non-null   float64
 3   death_year          6783 non-null    float64
 4   primary_profession  555308 non-null  object
 5   known_for_titles    576444 non-null  object
dtypes: float64(2), object(4)
memory usage: 27.8+ MB

None

'isna'

nconst                False
primary_name          False
birth_year             True
death_year             True
primary_profession     True
known_for_titles       True
dtype: bool

___________________________________________________________________

'imdb_title_principals'

      tconst  ordering     nconst  category  job   characters
0  tt0111414         1  nm0246005     actor  NaN  ["The Man"]
1  tt0111414         2  nm0398271  director  NaN          NaN

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   tconst      1028186 non-null  object
 1   ordering    1028186 non-null  int64
 2   nconst      1028186 non-null  object
 3   category    1028186 non-null  object
 4   job         177684 non-null   object
 5   characters  393360 non-null   object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB

None

'isna'

tconst        False
ordering      False
nconst        False
category      False
job            True
characters     True
dtype: bool

___________________________________________________________________

'imdb_title_crew'

      tconst  directors              writers
0  tt0285252  nm0899854            nm0899854
1  tt0438973        NaN  nm0175726,nm1802864

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 3 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   tconst     146144 non-null  object
 1   directors  140417 non-null  object
 2   writers    110261 non-null  object
dtypes: object(3)
memory usage: 3.3+ MB

None

'isna'

tconst       False
directors     True
writers       True
dtype: bool

___________________________________________________________________

'imdb_title_ratings'

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

None

'isna'

tconst           False
averagerating    False
numvotes         False
dtype: bool

___________________________________________________________________

'imdb_title_akas'

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   title_id           331703 non-null  object
 1   ordering           331703 non-null  int64
 2   title              331703 non-null  object
 3   region             278410 non-null  object
 4   language           41715 non-null   object
 5   types              168447 non-null  object
 6   attributes         14925 non-null   object
 7   is_original_title  331678 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB

None

'isna'

title_id             False
ordering             False
title                False
region                True
language              True
types                 True
attributes            True
is_original_title     True
dtype: bool

### Drop columns function 

To drop columns we can just do 
      
      df.drop(columns=['column_name_1', 'column_name_2'], inplace=True)

but we will get error on re-execution<br>
so lets create fuction and check column for existance before drop

In [3]:
def dropCol(in_df, cols):
    """
    Function dropCol drop defined columns 'cols' from gived DataFrame 'in_df'
    
    input: dataframe in_df, list cols
    output: dataframe
    """
    
    out_df = in_df;
    for col in cols:
        if col in out_df:
            #drop columns one at a time
            out_df.drop(columns=[col], inplace=True)
            
    return out_df

## Save needed data to DB

#### Esteblish connection and create database

In [35]:
conn = sqlite3.connect('movie.sqlite')
cur = conn.cursor()

### Create tables

with needed and cleaned data only

### tmdb_movies

In [36]:
# tmdb_movies

# Drop unnecessary columns
tmdb_movies = dropCol(
    dfDict['tmdb_movies'], 
    ['Unnamed: 0','genre_ids', 'id', 'original_language', 'vote_average', 'vote_count']
)
# Drop duplicate titles
tmdb_movies.drop_duplicates(subset='title', inplace=True)
# Reset index values
tmdb_movies.reset_index(drop=True, inplace=True)


cur.execute("""DROP TABLE IF EXISTS tmdb_movies;""")

#  0   Unnamed: 0         26517 non-null  int64  
#  1   genre_ids          26517 non-null  object 
#  2   id                 26517 non-null  int64  
#  3   original_language  26517 non-null  object 
#  4   original_title     26517 non-null  object 
#  5   popularity         26517 non-null  float64
#  6   release_date       26517 non-null  object 
#  7   title              26517 non-null  object 
#  8   vote_average       26517 non-null  float64
#  9   vote_count         26517 non-null  int64 

cur.execute("""CREATE TABLE tmdb_movies (
        id INTEGER PRIMARY KEY,
        original_title TEXT,
        popularity REAL,
        release_date TEXT,
        title TEXT
    )""")

cur.executemany("""INSERT INTO tmdb_movies( 
        original_title, 
        popularity, 
        release_date, 
        title ) 
    VALUES (?,?,?,?)""", tmdb_movies.values.tolist() )

# Ensure it is populated
#cur.execute("""SELECT * FROM tmdb_movies LIMIT 5;""").fetchall()

### tn_movie_budgets

In [37]:
# tn_movie_budgets
tn_movie_budgets = dropCol(dfDict['tn_movie_budgets'], ['id', 'domestic_gross'])
tn_movie_budgets.drop_duplicates(subset='movie', inplace=True)
tn_movie_budgets.reset_index(drop=True, inplace=True)

# remove $ sign and commas and cast to int
tn_movie_budgets['production_budget'] = tn_movie_budgets['production_budget'].replace('[\$,]', '', regex=True)
tn_movie_budgets['worldwide_gross'] = tn_movie_budgets['worldwide_gross'].replace('[\$,]', '', regex=True)
# why this does not work?!
#tn_movie_budgets[['production_budget', 'worldwide_gross']].replace('[\$,]', '', regex=True, inplace=True)
tn_movie_budgets = tn_movie_budgets.astype({'production_budget': 'int64', 'worldwide_gross': 'int64'})

cur.execute("""DROP TABLE IF EXISTS tn_movie_budgets;""")

#  0   id                 5782 non-null   int64 
#  1   release_date       5782 non-null   object
#  2   movie              5782 non-null   object
#  3   production_budget  5782 non-null   object
#  4   domestic_gross     5782 non-null   object
#  5   worldwide_gross    5782 non-null   object

cur.execute("""CREATE TABLE tn_movie_budgets (
        id INTEGER PRIMARY KEY,
        release_date TEXT,
        movie TEXT,
        production_budget INTEGER,
        worldwide_gross INTEGER
    )""")

cur.executemany("""INSERT INTO tn_movie_budgets( 
        release_date, 
        movie, 
        production_budget, 
        worldwide_gross ) 
    VALUES (?,?,?,?)""", tn_movie_budgets.values.tolist() )

# Ensure it is populated
#cur.execute("""SELECT * FROM tn_movie_budgets LIMIT 5;""").fetchall()

### imdb_title_basics

In [38]:
# imdb_title_basics
imdb_title_basics = None
imdb_title_basics = dropCol(dfDict['imdb_title_basics'], ['runtime_minutes'])
imdb_title_basics.drop_duplicates(subset='tconst', inplace=True)
#imdb_title_basics.drop_duplicates(subset='original_title', inplace=True)
imdb_title_basics.reset_index(drop=True, inplace=True)

# Drop the rows where at least one element is missing.
imdb_title_basics.dropna(inplace=True)

cur.execute("""DROP TABLE IF EXISTS imdb_title_basics;""")

#  0   tconst           146144 non-null  object 
#  1   primary_title    146144 non-null  object 
#  2   original_title   146123 non-null  object 
#  3   start_year       146144 non-null  int64  
#  4   runtime_minutes  114405 non-null  float64
#  5   genres           140736 non-null  object

cur.execute("""CREATE TABLE imdb_title_basics (
        id INTEGER PRIMARY KEY,
        tconst TEXT,
        primary_title TEXT, 
        original_title TEXT,
        start_year REAL,
        genres TEXT
    )""")

cur.executemany("""INSERT INTO imdb_title_basics( 
        tconst, 
        primary_title, 
        original_title, 
        start_year, 
        genres ) 
    VALUES (?,?,?,?,?)""", imdb_title_basics.values.tolist() )

# Ensure it is populated
#cur.execute("""SELECT * FROM imdb_title_basics LIMIT 5;""").fetchall()

### imdb_name_basics

In [39]:
# imdb_name_basics
imdb_name_basics = dropCol(
    dfDict['imdb_name_basics'], 
    ['birth_year', 'death_year', 'primary_profession', 'known_for_titles']
)
imdb_name_basics.drop_duplicates(subset='nconst', inplace=True)
imdb_name_basics.reset_index(drop=True, inplace=True)

# Drop the rows where at least one element is missing.
imdb_name_basics.dropna(inplace=True)

cur.execute("""DROP TABLE IF EXISTS imdb_name_basics;""")

#  0   nconst              606648 non-null  object 
#  1   primary_name        606648 non-null  object 
#  2   birth_year          82736 non-null   float64
#  3   death_year          6783 non-null    float64
#  4   primary_profession  555308 non-null  object 
#  5   known_for_titles    576444 non-null  object 

cur.execute("""CREATE TABLE imdb_name_basics (
        id INTEGER PRIMARY KEY,
        nconst TEXT,
        primary_name TEXT
    )""")

cur.executemany("""INSERT INTO imdb_name_basics( 
        nconst, 
        primary_name ) 
    VALUES (?,?)""", imdb_name_basics.values.tolist() )

# Ensure it is populated
#cur.execute("""SELECT * FROM imdb_name_basics LIMIT 5;""").fetchall()

### imdb_title_principals

In [40]:
# imdb_title_principals
imdb_title_principals = dropCol(
    dfDict['imdb_title_principals'], 
    ['ordering', 'job', 'characters']
)
imdb_title_principals.drop_duplicates(subset=['tconst', 'nconst'], inplace=True)
imdb_title_principals.reset_index(drop=True, inplace=True)

# Drop the rows where at least one element is missing.
imdb_title_principals.dropna(inplace=True)

cur.execute("""DROP TABLE IF EXISTS imdb_title_principals;""")

#  0   tconst      1028186 non-null  object
#  1   ordering    1028186 non-null  int64 
#  2   nconst      1028186 non-null  object
#  3   category    1028186 non-null  object
#  4   job         177684 non-null   object
#  5   characters  393360 non-null   object

cur.execute("""CREATE TABLE imdb_title_principals (
        id INTEGER PRIMARY KEY,
        tconst TEXT, 
        nconst TEXT,
        category TEXT
    )""")

cur.executemany("""INSERT INTO imdb_title_principals( 
        tconst, 
        nconst, 
        category ) 
    VALUES (?,?,?)""", imdb_title_principals.values.tolist() )

# Ensure it is populated
#cur.execute("""SELECT * FROM imdb_title_principals LIMIT 5;""").fetchall()

In [41]:
conn.commit()